# THIS FILE IS AUTOMATICALLY GENERATED
# Project: \\vmware-host\Shared Folders\Documents\PSoC Creator\CY8CKIT-145-Examples\SmartIO\SmartIOCountUp.cydsn\SmartIOCountUp.cyprj
# Date: Tue, 08 Mar 2016 10:35:19 GMT
#set_units -time ns
create_clock -name {CapSense_ModClk(FFB)} -period 10625 -waveform {0 5312.5} [list [get_pins {ClockBlock/ff_div_2}]]
create_clock -name {Clock_1(FFB)} -period 200000 -waveform {0 100000} [list [get_pins {ClockBlock/ff_div_3}]]
create_clock -name {CyILO} -period 25000 -waveform {0 12500} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 25000 -waveform {0 12500} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySYSCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {CapSense_ModClk} -source [get_pins {ClockBlock/hfclk}] -edges {1 255 511} [list]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/hfclk}] -edges {1 4801 9601} [list]


# Component constraints for \\vmware-host\Shared Folders\Documents\PSoC Creator\CY8CKIT-145-Examples\SmartIO\SmartIOCountUp.cydsn\TopDesign\TopDesign.cysch
# Project: \\vmware-host\Shared Folders\Documents\PSoC Creator\CY8CKIT-145-Examples\SmartIO\SmartIOCountUp.cydsn\SmartIOCountUp.cyprj
# Date: Tue, 08 Mar 2016 10:35:17 GMT
